# ფაილი: task1.py
# შესაფასებელი ქულა: 0-2
# ამოცანა:
# დაწერეთ პროგრამა, რომელიც ეკითხება მომხმარებელს რამდენიმე სიტყვას (მინიმუმ 3-ს).
# პროგრამამ უნდა დააბრუნოს მხოლოდ ის სიტყვები, რომლებიც ბოლო ასო "i"-ით მთავრდება, თითოეული ახალ ხაზზე.
# ასევე დაბეჭდეთ რამდენი ასეთი სიტყვა არსებობს.


def task1():
    word = input("შეიყვანეთ სიტყვა: ")

    list1 = word.split()
    list2 = []

    for i in list1:
        if i.endswith("i") or i.endswith("I"):
            list2.append(i)

    return list2 , len(list1)
        
    
    

print(task1())