# ფაილი: task2.py
# შესაფასებელი ქულა: 0-2
# ამოცანა:
# დაწერეთ პროგრამა, რომელიც ეკითხება მომხმარებელს წინადადებას.
# პროგრამამ უნდა დაითვალოს თითოეული სიტყვის სიგრძე და დაბეჭდოს მხოლოდ ის სიტყვები, რომლებიც 5–დან 7 ასომდე შეიცავს.

# გასაგებია, ეს ამოცანა ცოტა არ არის მკაფიო და ტექნიკურად რთული ზუსტად ისეთი ფორმით, როგორც წერია. შემიძლია შევცვალოთ ის უფრო მარტივად გასაგები, მაგრამ მაინც უნიკალური სტრუქტურით, ისე რომ ჯდება დონე 1–3 (0–2 ქულა), მაგრამ რეალურად უფრო საინტერესო იყოს.


def task2():
    sentence = input("შეიყვანეთ წინადადება: ")

    words = sentence.split()

    for i in words:
        if 5 <= len(i) <= 7:
            print(i)

task2()